3 Import the required packages with their customary aliases as follows:

In [235]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
%matplotlib inline

In [236]:

pd.set_option('display.max_rows', None)

4 Use the %matplotlib inline magic command so that your plots show in the notebook without having to   call plt.show() every time.

5 Using the pandas read_csv() method, read the GDP dataset into your notebook as a DataFrame 
  called gdp_df. Take a look at the first 6 rows.

In [237]:
gdp_df = pd.read_csv('data\gdp_percapita.csv',nrows=6606)
#gdp_df = pd.read_csv('..\gdp_percapita.csv') ..if it was in the one folder above

In [238]:
gdp_df.head()

  Country or Area  Year        Value  Value Footnotes
0     Afghanistan  2018  2190.240321              NaN
1     Afghanistan  2017  2202.570851              NaN
2     Afghanistan  2016  2200.764487              NaN
3     Afghanistan  2015  2212.750899              NaN
4     Afghanistan  2014  2249.253738              NaN

6 Repeat for the internet use dataset. Call this DataFrame internet_df. Take a look at the first six rows.

In [239]:
internet_df = pd.read_csv('data\internet_use.csv',nrows=4495)

In [240]:
internet_df.head(6)

  Country or Area  Year     Value  Value Footnotes  Unnamed: 4  Unnamed: 5
0     Afghanistan  2014  6.390000              NaN         NaN         NaN
1     Afghanistan  2013  5.900000              NaN         NaN         NaN
2     Afghanistan  2012  5.454545              NaN         NaN         NaN
3     Afghanistan  2011  5.000000              NaN         NaN         NaN
4     Afghanistan  2010  4.000000              NaN         NaN         NaN
5     Afghanistan  2009  3.550000              NaN         NaN         NaN

7 Look at the shape of each DataFrame - how many rows? How many columns?

In [241]:
len(gdp_df)    #number of rows in gdp

6606

In [242]:
len(internet_df)   #number of rows in iu with out the footnotes

4495

In [243]:
len(gdp_df.columns)
len(internet_df.columns)

6

In [244]:
dataTypeSeries = gdp_df.dtypes
print('Data type of each column of gdp_df :')
print(dataTypeSeries)

Data type of each column of gdp_df :
Country or Area     object
Year                 int64
Value              float64
Value Footnotes    float64
dtype: object

#8 Take a look at the datatypes for the columns in each DataFrame.

In [245]:

gdp_df.info()
internet_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6606 entries, 0 to 6605
Data columns (total 4 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Country or Area  6606 non-null   object
 1   Year             6606 non-null   int64
 2   Value            6606 non-null   float64
 3   Value Footnotes  1 non-null      float64
dtypes: float64(2), int64(1), object(1)
memory usage: 206.6+ KB
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4495 entries, 0 to 4494
Data columns (total 6 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Country or Area  4495 non-null   object
 1   Year             4495 non-null   int64
 2   Value            4495 non-null   float64
 3   Value Footnotes  948 non-null    float64
 4   Unnamed: 4       0 non-null      float64
 5   Unnamed: 5       0 non-null      float64
dtypes: float64(4), int64(1), object(1)
memory usage: 210.8+ KB

#9 Take a look at the last 10 rows of each DataFrame in turn.

In [246]:
gdp_df.tail(10)
#internet_df.tail(10)

     Country or Area  Year        Value  Value Footnotes
6596        Zimbabwe  1999  3600.849291              NaN
6597        Zimbabwe  1998  3653.920016              NaN
6598        Zimbabwe  1997  3580.048793              NaN
6599        Zimbabwe  1996  3520.430146              NaN
6600        Zimbabwe  1995  3226.413930              NaN
6601        Zimbabwe  1994  3263.934978              NaN
6602        Zimbabwe  1993  3033.504852              NaN
6603        Zimbabwe  1992  3054.889178              NaN
6604        Zimbabwe  1991  3426.598094              NaN
6605        Zimbabwe  1990  3324.348171              NaN

10  Drop the value footnotes column from both  DataFrames.Check that this worked as expected.

In [247]:
internet_df.drop(columns=['Value Footnotes','Unnamed: 4','Unnamed: 5'],inplace=True)
internet_df.head()

  Country or Area  Year     Value
0     Afghanistan  2014  6.390000
1     Afghanistan  2013  5.900000
2     Afghanistan  2012  5.454545
3     Afghanistan  2011  5.000000
4     Afghanistan  2010  4.000000

In [248]:
gdp_df.drop(columns=['Value Footnotes'],inplace=True)
gdp_df.head()

  Country or Area  Year        Value
0     Afghanistan  2018  2190.240321
1     Afghanistan  2017  2202.570851
2     Afghanistan  2016  2200.764487
3     Afghanistan  2015  2212.750899
4     Afghanistan  2014  2249.253738

11 Change the columns for the GDP Per Capita DataFrame to ‘Country’, ‘Year’, and ‘GDP_Per_Capita’.

In [251]:
new_col_names_gdp = ['Country','Year','GDP_Per_Capita']
gdp_df.columns = new_col_names_gdp
gdp_df.head()

       Country  Year  GDP_Per_Capita
0  Afghanistan  2018     2190.240321
1  Afghanistan  2017     2202.570851
2  Afghanistan  2016     2200.764487
3  Afghanistan  2015     2212.750899
4  Afghanistan  2014     2249.253738

12 Change the columns for the Internet Users DataFrame to ‘Country’, ‘Year’, and 
   ‘Internet_Users_Pct’.

In [252]:
new_col_names_int = ['Country','Year','Internet_Users_Pct']
internet_df.columns = new_col_names_int
internet_df.head()

       Country  Year  Internet_Users_Pct
0  Afghanistan  2014            6.390000
1  Afghanistan  2013            5.900000
2  Afghanistan  2012            5.454545
3  Afghanistan  2011            5.000000
4  Afghanistan  2010            4.000000

In [262]:
gdp_df['Year'].astype(float)#.astype('int')
gdp_and_internet_use = pd.merge(gdp_df, internet_df, how='outer')
#gdp_and_internet_use.shape
gdp_and_internet_use.head()

       Country  Year  GDP_Per_Capita  Internet_Users_Pct
0  Afghanistan  2018     2190.240321                 NaN
1  Afghanistan  2017     2202.570851                 NaN
2  Afghanistan  2016     2200.764487                 NaN
3  Afghanistan  2015     2212.750899                 NaN
4  Afghanistan  2014     2249.253738                6.39

In [268]:
gdp_df['Year'].astype('int')
gdp_and_internet_use = pd.merge(gdp_df, internet_df, how='outer')
gdp_and_internet_use.shape
gdp_and_internet_use
gdp_and_internet_use.head()

       Country  Year  GDP_Per_Capita  Internet_Users_Pct
0  Afghanistan  2018     2190.240321                 NaN
1  Afghanistan  2017     2202.570851                 NaN
2  Afghanistan  2016     2200.764487                 NaN
3  Afghanistan  2015     2212.750899                 NaN
4  Afghanistan  2014     2249.253738                6.39

In [111]:
"""
This is a "block comment" in Python, made
out of a mult-line string constant.
This actually works quite well!
"""
print(42)

42

In [114]:
'''
This is a "block comment" in Python, made
out of a mult-line string constant.
This actually works quite well!
'''
print(42)

42